---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetConvertedFabricationParts
source: html/3461800e-90b9-2961-313d-ceb5c6e48b69.htm
---
# Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetConvertedFabricationParts Method

Gets the set of element identifiers for newly created fabrication parts.

## Syntax (C#)
```csharp
public ISet<ElementId> GetConvertedFabricationParts()
```

## Remarks
This set of element identifiers is only available after the Convert method has been invoked.